--insert into
insert into 學生(學號,生日,電話,姓名,性別)
values('S999','1999-9-9','07-777777','林平之','男')

insert into 學生(學號,姓名,性別)
values('S998','岳不群','男')

insert into 學生(學號,生日,電話,姓名,性別)
values('S997','','','','')

insert into 學生(學號,生日,電話,姓名,性別)
values('S996','','',' ','')

select * from 學生
where 電話 is null
---------------------------------------
--省略欄位的寫法
--注意1. 所有欄位都得給值
--注意2. 給值的順序須依照資料表欄位順序
insert into 學生
values('S888','林平之','男','07-777777','1999-9-9')


insert into 學生
values('S887','岳不群','男',null,null)
----------------------------
--批次給值
insert into 學生
values('S777','林平之','男','07-777777','1999-9-9'),
('S776','林平之','男','07-777777','1999-9-9'),
('S775','林平之','男','07-777777','1999-9-9'),
('S774','林平之','男','07-777777','1999-9-9'),
('S773','林平之','男','07-777777','1999-9-9'),
('S772','林平之','男','07-777777','1999-9-9'),
('S771','林平之','男','07-777777','1999-9-9'),
('S770','林平之','男','07-777777','1999-9-9')


----------------------------------------------------
--insert/select
select *
into 課程2
from 課程

insert into 課程2
select 教授編號,科系,5 from 教授


