--insert into 新增資料(不用按照順序)
insert into 學生(學號,生日,電話,姓名,性別)
values('S999','1999/9/9','07-1234567','林平之','男')

insert into 學生(學號,姓名,性別)
values('S998','岳不群','男')

insert into 學生(學號,生日,電話,姓名,性別)
values('S997','','','','')
--Null不等於''

---------------------------
--省略欄位的寫法
--1.所有欄位都要給值
--2.按照資料表的順序
insert into 學生
values('S888','林平之','男',null,null)
-----------------------------------
--insert/select 
--新增課程2資料表，從課程資料表(複製新的資料表)
select *
into 課程2
from 課程

--將資料表的欄位加入現有的資料表
insert into 課程2
select 教授編號,科系,123 from 教授
